data/testCase/system/controlDict
// -*- C++ -*-
// File generated by PyFoam - sorry for the ugliness

FoamFile
{
 version 2.0;
 format ascii;
 class dictionary;
 object controlDict;
}

application simpleFoam;

startFrom latestTime;

startTime 0;

stopAt endTime;

endTime 400;

deltaT 1;

writeControl timeStep;

writeInterval 50;

purgeWrite 0;

writeFormat binary;

writePrecision 6;

writeCompression no;
timeFormat general;

timePrecision 6;

runTimeModifiable yes;
functions
{
} 	// #include "ensightWrite"// #include "vtkWrite"// // Demonstrate runTimePostProcessing// #include "visualization"// #include "profiling"// ************************************************************************* //

