data/testCase/system/meshDict
// -*- C++ -*-
// File generated by PyFoam - sorry for the ugliness

FoamFile
{
 version 2.0;
 format ascii;
 class dictionary;
 location "system";
 object meshDict;
}

surfaceFile "constant/triSurface/box-in-box.stl";

maxCellSize 0.5;

boundaryCellSize 0.1; 	// objectRefinements// {//     refinmentBox//     {//         type box;//         cellSize 30;//         centre (0 250 0);//         lengthX 3000;//         lengthY 500;//         lengthZ 3000;//     }// }

localRefinement
{
  "object.*"
  {
    cellSize 0.1;
  }
} 	// additionalRefinementLevels 7;

boundaryLayers
{
  patchBoundaryLayers
  {
    "object.*"
    {
      nLayers 5;
      thicknessRatio 1.2;
    }
  }
  optimiseLayer 1;
  optimisationParameters
  {
    nSmoothNormals 3;
    maxNumIterations 2;
    featureSizeFactor 0.4;
    reCalculateNormals 1;
    relThicknessTol 0.1;
  }
}

renameBoundary
{
  defaultName fixedWalls;
  defaultType symmetry;
  newPatchNames
  {
    "xMin"
    {
      type patch;
      newName inlet;
    }
    "xMax"
    {
      type patch;
      newName outlet;
    }
    "yMin"
    {
      type wall;
      newName ground;
    }
    "object"
    {
      type wall;
      newName object;
    }
  }
} 	// ************************************************************************* //

