data/testCase/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2212                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


5
(
inlet
{
    type patch;
    nFaces 2500;
    startFace 184164;
}

outlet
{
    type patch;
    nFaces 2500;
    startFace 186664;
}

ground
{
    type wall;
    nFaces 2608;
    startFace 189164;
}

object
{
    type wall;
    nFaces 2700;
    startFace 191772;
}

fixedWalls
{
    type symmetry;
    nFaces 7500;
    startFace 194472;
}

)


// ************************************************************************* //
