data/testCase/0.orig/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2212                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

Uinlet          (10 0 0);

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    inlet
    {
        type fixedValue;
        value uniform $Uinlet;
    }

    outlet
    {
        type pressureInletOutletVelocity;
        value uniform (0 0 0);
    }

    ground
    {
        type noSlip;
    }

    object
    {
        type noSlip;
    }

    fixedWalls
    {
        type symmetry;
    }

    // inlet
    // {
    //     type            fixedValue;
    //     value           uniform $Uinlet;
    // }

    // outlet
    // {
    //     type            pressureInletOutletVelocity;
    //     value           uniform (0 0 0);
    // }

    // wall
    // {
    //     type            noSlip;
    // }

    #includeEtc "caseDicts/setConstraintTypes"
}


// ************************************************************************* //
