data/testCase/0.orig/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2212                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    inlet
    {
        type zeroGradient;
    }

    outlet
    {
        type totalPressure;
        p0 uniform 0;
    }

    ground
    {
        type zeroGradient;
    }

    object
    {
        type zeroGradient;
    }

    fixedWalls
    {
        type symmetry;
    }


    // inlet
    // {
    //     type            zeroGradient;
    // }

    // outlet
    // {
    //     type            totalPressure;
    //     p0              uniform 0;
    // }

    // wall
    // {
    //     type            zeroGradient;
    // }

    #includeEtc "caseDicts/setConstraintTypes"
}


// ************************************************************************* //
