data/testCase/0.orig/epsilon
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2212                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      epsilon;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

epsilonInlet  0.03; // Cmu^0.75 * k^1.5 / L ; L =10

dimensions      [0 2 -3 0 0 0 0];

internalField   uniform $epsilonInlet;

boundaryField
{
    inlet
    {
        type fixedValue;
        value uniform $epsilonInlet;
    }

    outlet
    {
        type inletOutlet;
        inletValue uniform $epsilonInlet;
        value uniform $epsilonInlet;
    }

    ground
    {
        type epsilonWallFunction;
        value uniform $epsilonInlet;
    }

    object
    {
        type epsilonWallFunction;
        value uniform $epsilonInlet;
    }

    fixedWalls
    {
        type symmetry;
    }



    // inlet
    // {
    //     type            fixedValue;
    //     value           uniform $epsilonInlet;
    // }

    // outlet
    // {
    //     type            inletOutlet;
    //     inletValue      uniform $epsilonInlet;
    //     value           uniform $epsilonInlet;
    // }

    // ground
    // {
    //     type            epsilonWallFunction;
    //     value           uniform $epsilonInlet;
    // }

    #includeEtc "caseDicts/setConstraintTypes"
}


// ************************************************************************* //
