data/testCase/0.orig/k
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2212                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

kInlet          1.5;   // approx k = 1.5*(I*U)^2 ; I = 0.1

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform $kInlet;

boundaryField
{
    inlet
    {
        type fixedValue;
        value uniform $kInlet;
    }

    outlet
    {
        type inletOutlet;
        inletValue uniform $kInlet;
        value uniform $kInlet;
    }

    ground
    {
        type kqRWallFunction;
        value uniform $kInlet;
    }

    object
    {
        type kqRWallFunction;
        value uniform $kInlet;
    }

    fixedWalls
    {
        type symmetry;
    }

    // inlet
    // {
    //     type            fixedValue;
    //     value           uniform $kInlet;
    // }

    // outlet
    // {
    //     type            inletOutlet;
    //     inletValue      uniform $kInlet;
    //     value           uniform $kInlet;
    // }

    // wall
    // {
    //     type            kqRWallFunction;
    //     value           uniform $kInlet;
    // }

    #includeEtc "caseDicts/setConstraintTypes"
}


// ************************************************************************* //
