data/testCase/0.orig/nut
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2212                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    inlet
    {
        type calculated;
        value uniform 0;
    }

    outlet
    {
        type calculated;
        value uniform 0;
    }

    ground 
    {
        type nutkWallFunction;
        value uniform 0;
    }

    object 
    {
        type nutkWallFunction;
        value uniform 0;
    }

    fixedWalls
    {
        type symmetry;
    }

    // inlet
    // {
    //     type            calculated;
    //     value           uniform 0;
    // }

    // outlet
    // {
    //     type            calculated;
    //     value           uniform 0;
    // }

    // wall
    // {
    //     type            nutkWallFunction;
    //     value           uniform 0;
    // }

    #includeEtc "caseDicts/setConstraintTypes"
}


// ************************************************************************* //
