data/testCase/system/fvSolution
// -*- C++ -*-
// File generated by PyFoam - sorry for the ugliness

FoamFile
{
 version 2.0;
 format ascii;
 class dictionary;
 object fvSolution;
}

solvers
{
  p
  {
    solver GAMG;
    smoother GaussSeidel;
    tolerance 1e-06;
    relTol 0.1;
  }
  "(U|k|omega|epsilon)"
  {
    solver smoothSolver;
    smoother symGaussSeidel;
    tolerance 1e-06;
    relTol 0.1;
  }
}

SIMPLE
{
  residualControl
  {
    p 0.02;
    U 0.01;
    "(k|omega|epsilon)" 0.01;
  }
  nNonOrthogonalCorrectors 2;
  pRefCell 0;
  pRefValue 0;
}

potentialFlow
{
  nNonOrthogonalCorrectors 10;
}

relaxationFactors
{
  fields
  {
    p 0.3;
  }
  equations
  {
    U 0.7;
    "(k|omega|epsilon).*" 0.7;
  }
} 	// ************************************************************************* //

